In [1]:
import pandas as pd

In [2]:
myseries = pd.Series([439, 98, 65, 'carrot', 'parrot'])
mylist = [439, 98, 65, 'carrot', 'parrot']

print(mylist)
print(mylist)

[439, 98, 65, 'carrot', 'parrot']
[439, 98, 65, 'carrot', 'parrot']

In [3]:
print("hello")

hello

In [4]:
mylist = (439, 98, 65, 'carrot', 'parrot')
print(mylist)

(439, 98, 65, 'carrot', 'parrot')

In [11]:
import pandas as pd

In [12]:
Holdata = pd.read_csv("Holdata.csv")

print (Holdata)

   Destination  Feedback (1-10)  Average Hotel Star  \
0        Spain                7                   3
1      Holland                8                   4
2        India                4                   4
3       Greece                8                   3
4       France                7                   4
5      Germany                5                   4
6          USA                8                   3
7        Italy                5                   5
8       Norway                6                   3
9      Denmark                7                   4
10     Jamaica                5                   4
11    Barbados                8                   3
12    Portugal                6                   3
13       Kenya                7                   2

    No. of all inclusiive Holiday  Most Visited City
0                             2134            Madrid
1                              345         Amsterdam
2                             2000             Delhi
3                             3244            Athens
4                             1234             Paris
5                           123444            Berlin
6                             4321          New York
7                              234              Rome
8                              123              Oslo
9                              156        Copenhagen
10                             245       Montego Bay
11                             356        bridgetown
12                             321            Lisbon
13                             546          Mombassa

In [13]:
## retrieving pet name as a series
print(Holdata["Destination"])

0        Spain
1      Holland
2        India
3       Greece
4       France
5      Germany
6          USA
7        Italy
8       Norway
9      Denmark
10     Jamaica
11    Barbados
12    Portugal
13       Kenya
Name: Destination, dtype: object

In [14]:
## retrieving pet name as a dataframe
print(Holdata[["Destination"]])

   Destination
0        Spain
1      Holland
2        India
3       Greece
4       France
5      Germany
6          USA
7        Italy
8       Norway
9      Denmark
10     Jamaica
11    Barbados
12    Portugal
13       Kenya

In [15]:
print(Holdata[["Destination","Most Visited City"]])

   Destination Most Visited City
0        Spain            Madrid
1      Holland         Amsterdam
2        India             Delhi
3       Greece            Athens
4       France             Paris
5      Germany            Berlin
6          USA          New York
7        Italy              Rome
8       Norway              Oslo
9      Denmark        Copenhagen
10     Jamaica       Montego Bay
11    Barbados        bridgetown
12    Portugal            Lisbon
13       Kenya          Mombassa

Homework Task 2

In [34]:
print(Holdata[3:9])

  Destination  Feedback (1-10)  Average Hotel Star  \
3      Greece                8                   3
4      France                7                   4
5     Germany                5                   4
6         USA                8                   3
7       Italy                5                   5
8      Norway                6                   3

   No. of all inclusiive Holiday  Most Visited City
3                            3244            Athens
4                            1234             Paris
5                          123444            Berlin
6                            4321          New York
7                             234              Rome
8                             123              Oslo

In [22]:
print(Holdata.iloc[1])

Destination                         Holland
Feedback (1-10)                           8
Average Hotel Star                        4
No. of all inclusiive Holiday           345
Most Visited City                 Amsterdam
Name: 1, dtype: object

In [25]:
Holdata = pd.read_csv("Holdata.csv", index_col="Destination")
print(Holdata.loc[["India", "Greece"]])

             Feedback (1-10)  Average Hotel Star  \
Destination
India                      4                   4
Greece                     8                   3

             No. of all inclusiive Holiday  Most Visited City
Destination
India                                  2000             Delhi
Greece                                 3244            Athens

In [27]:
Holdata = pd.read_csv("Holdata.csv")
print(Holdata.iloc[3, 4])

Athens

In [40]:
Holdata = pd.read_csv("Holdata.csv")
print(Holdata.iloc[3:9,0:3])

  Destination  Feedback (1-10)  Average Hotel Star
3      Greece                8                   3
4      France                7                   4
5     Germany                5                   4
6         USA                8                   3
7       Italy                5                   5
8      Norway                6                   3

In [41]:
import pandas as pd

In [43]:
#Homework Task 1
Holdata = pd.read_csv("Holdata.csv")
Holdata.shape

(14, 5)

In [47]:
Holdata = pd.read_csv("Holdata.csv")
Holdata.head (2)

,Destination,Feedback (1-10),Average Hotel Star,No. of all inclusiive Holiday,Most Visited City
0,Spain,7,3,2134,Madrid
1,Holland,8,4,345,Amsterdam

In [46]:
Holdata.tail (4)

,Destination,Feedback (1-10),Average Hotel Star,No. of all inclusiive Holiday,Most Visited City
10,Jamaica,5,4,245,Montego Bay
11,Barbados,8,3,356,bridgetown
12,Portugal,6,3,321,Lisbon
13,Kenya,7,2,546,Mombassa

In [48]:
Holdata.head ()

,Destination,Feedback (1-10),Average Hotel Star,No. of all inclusiive Holiday,Most Visited City
0,Spain,7,3,2134,Madrid
1,Holland,8,4,345,Amsterdam
2,India,4,4,2000,Delhi
3,Greece,8,3,3244,Athens
4,France,7,4,1234,Paris

In [51]:
Holdata = pd.read_csv("Holdata.csv")
Holdata[["Most Visited City"]]

   Most Visited City
0             Madrid
1          Amsterdam
2              Delhi
3             Athens
4              Paris
5             Berlin
6           New York
7               Rome
8               Oslo
9         Copenhagen
10       Montego Bay
11        bridgetown
12            Lisbon
13          Mombassa

In [107]:
Holdata = pd.read_csv("Holdata.csv")
type(Holdata["Most Visited City"])

pandas.core.series.Series

In [71]:
#Homework 3
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata["No. of all inclusiive Holiday "].mean()

9907.357142857143

In [72]:
#Homework 3
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata.mean()

C:\Users\sadex\AppData\Local\Temp/ipykernel_20224/3874975955.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Holdata.mean()

Feedback (1-10)                      6.500000
Average Hotel Star                   3.500000
No. of all inclusiive Holiday     9907.357143
dtype: float64

In [109]:
#Homework Question 4
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata['Destination'].min()

'Barbados'

In [108]:
#Homework Question 5
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata['Destination'].max()

'USA'

In [97]:
#Homework Question 6 adapted criteria as numbers were too high
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata["No. of all inclusiive Holiday "]> 500

0      True
1     False
2      True
3      True
4      True
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
Name: No. of all inclusiive Holiday , dtype: bool

In [85]:
#Homework Question 7
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata["No. of all inclusiive Holiday "]< 500

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13    False
Name: No. of all inclusiive Holiday , dtype: bool

In [94]:
#Homework Question 8
import pandas as pd
Holdata = pd.read_csv("Holdata.csv")
Holdata["No. of all inclusiive Holiday "]< 200

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10    False
11    False
12    False
13    False
Name: No. of all inclusiive Holiday , dtype: bool

In [112]:
#######
from sklearn.datasets import load_iris
data = load_iris()
df   = pd.DataFrame(data['data'], columns=data['feature_names'])
df['species']= data['target']
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0